OFFICIAL_MAP_ORDER = [
    "绿色山谷", "黄昏小镇", "风车农场", "酋长部落", "钟楼魅影", "XTORM乐园", "城堡的冬天",
    "小赛车场", "火山", "长城", "A519公路", "恐龙乐园★", "藏宝海湾★", "月亮城堡★",
    "西部矿洞", "快乐农场", "海上大桥", "山谷要塞", "大赛车场", "U型山谷", "秋名山-下",
    "秋名山-上", "A1港口", "宇宙大帝", "精灵传说", "遥望迪拜", "沉默都市", "香港",
    "迷失沙漠", "雪邦", "决战山脊", "好运北京", "ZIC", "英伦秋色", "太空堡垒",
    "星际之门", "Intel乐园", "蒙特卡罗", "马尼拉", "星球大战", "飘渺之旅", "迷失森林",
    "迷宫", "酋长部落II", "雪域冰川", "海底世界", "楼兰古道", "吉祥万里", "龙珠蛇道",
    "上海世博", "加泰罗尼亚", "巴林", "大大乐园", "快乐圣诞", "穿山越岭", "空中城堡",
    "怪魔禁地", "旋云圣殿", "风车农场2", "太空驿站", "极限矿山", "蒸汽工厂", "29",
    "小柔的N乐园", "小柔的泰姬陵"
]

GAME_MODES = ["个人竞速", "组队竞速", "个人道具", "组队道具", "个人疾爽", "组队疾爽"]
